import Mock from "mockjs"

export default Mock.mock('/getRooms', {
  "status": "success",
  "status_code": "200",
  "emptyRooms": [
    {
      "id": 1,
      "site": "澳门六枝特区"
    },
    {
      "id": 2,
      "site": "武汉清浦区"
    },
    {
      "id": 3,
      "site": "贵阳白云区"
    },
    {
      "id": 4,
      "site": "天津孝南区"
    },
    {
      "id": 5,
      "site": "重庆涪城区"
    },
    {
      "id": 6,
      "site": "长沙西夏区"
    },
    {
      "id": 8,
      "site": "沈阳城东区"
    },
    {
      "id": 9,
      "site": "银川平山区"
    },
    {
      "id": 10,
      "site": "济南翔安区"
    },
    {
      "id": 11,
      "site": "西宁魏都区"
    },
    {
      "id": 12,
      "site": "海口上街区"
    },
    {
      "id": 13,
      "site": "澳门金水区"
    },
    {
      "id": 14,
      "site": "杭州白云区"
    },
    {
      "id": 15,
      "site": "海口南长区"
    },
    {
      "id": 16,
      "site": "银川孝南区"
    },
    {
      "id": 17,
      "site": "长春长寿区"
    },
    {
      "id": 18,
      "site": "北京新区"
    },
    {
      "id": 19,
      "site": "合肥锡山区"
    },
    {
      "id": 20,
      "site": "昆明经济开发新区"
    },
    {
      "id": 21,
      "site": "重庆海港区"
    },
    {
      "id": 22,
      "site": "兰州孝南区"
    },
    {
      "id": 23,
      "site": "福州锡山区"
    },
    {
      "id": 24,
      "site": "海口新城区"
    },
    {
      "id": 25,
      "site": "广州永川区"
    },
    {
      "id": 26,
      "site": "南宁华龙区"
    },
    {
      "id": 27,
      "site": "杭州沙市区"
    },
    {
      "id": 28,
      "site": "南昌上街区"
    },
    {
      "id": 29,
      "site": "呼和浩特涪城区"
    },
    {
      "id": 30,
      "site": "武汉萧山区"
    },
    {
      "id": 31,
      "site": "长沙高新开发区"
    },
    {
      "id": 32,
      "site": "上海魏都区"
    },
    {
      "id": 33,
      "site": "昆明萧山区"
    },
    {
      "id": 34,
      "site": "呼和浩特沈河区"
    },
    {
      "id": 35,
      "site": "济南经济开发新区"
    },
    {
      "id": 36,
      "site": "福州锡山区"
    },
    {
      "id": 37,
      "site": "上海魏都区"
    },
    {
      "id": 38,
      "site": "石家庄海陵区"
    },
    {
      "id": 39,
      "site": "长沙西夏区"
    },
    {
      "id": 40,
      "site": "上海沙市区"
    }
  ]
})

